app/controllers/clients_controller.rb

INSERT INTO "clients" ("ativo", "cpf", "created_at", "data_nascimento", "email_id", "endereco_id", "estado_civil_id", "hobby_id", "local_nascimento", "nome", "nome_mae", "nome_pai", "observacoes", "quantidade_filhos", "religiao_id", "rg", "telefone_id", "trabalho_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @client = Client.new(params[:client])

    respond_to do |format|
      if @client.save

SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "clients" SET "data_nascimento" = '2012-09-01', "nome_mae" = '', "nome" = '', "rg" = '', "local_nascimento" = '', "cpf" = '', "nome_pai" = '', "observacoes" = '', "updated_at" = '2012-09-01 00:37:30.437640' WHERE "clients"."id" = 4
---
  def update
    @client = Client.find(params[:id])

    respond_to do |format|
      if @client.update_attributes(params[:client])

SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "clients" SET "updated_at" = '2012-09-01 00:56:10.303713', "ativo" = 'f' WHERE "clients"."id" = 4
---
  def destroy
    @client = Client.find(params[:id])
    @client.ativo = false
    @client.update_attributes(params[:client])